// NOTE Or change houseConst.js .json
exports.NewTaipeiDistricts = {
    萬里區: 207,
    金山區: 208,
    板橋區: 220,
    汐止區: 221,
    深坑區: 222,
    石碇區: 223,
    瑞芳區: 224,
    平溪區: 226,
    雙溪區: 227,
    貢寮區: 228,
    新店區: 231,
    坪林區: 232,
    烏來區: 233,
    永和區: 234,
    中和區: 235,
    土城區: 236,
    三峽區: 237,
    樹林區: 238,
    鶯歌區: 239,
    三重區: 241,
    新莊區: 242,
    泰山區: 243,
    林口區: 244,
    蘆洲區: 247,
    五股區: 248,
    八里區: 249,
    淡水區: 251,
    三芝區: 252,
    石門區: 253,
};
exports.TaipeiDistricts = {
    // key為3碼郵遞區號
    中正區: '100',
    大同區: '103',
    中山區: '104',
    松山區: '105',
    大安區: '106',
    萬華區: '108',
    信義區: '110',
    士林區: '111',
    北投區: '112',
    內湖區: '114',
    南港區: '115',
    文山區: '116',
};
// 一季, 某一city
// A, B資料可能各有1萬筆, 如果都先只readCSV, 要存兩萬筆
// 如果是區資料, 可能是北市13區, 先read完, 都存在 array裡, A資料家起來也會是1萬筆
// 所以可以是// dataA[totoal]
exports.cityCode = {
    C: {
        name: '基隆市',
    },
    A: {
        name: '臺北市',
    },
    F: {
        name: '新北市',
    },
    H: {
        name: '桃園市',
    },
    O: {
        name: '新竹市',
    },
    J: {
        name: '新竹縣',
    },
    K: {
        name: '苗栗縣',
    },
    B: {
        name: '臺中市',
    },
    M: {
        name: '南投縣',
    },
    N: {
        name: '彰化縣',
    },
    P: {
        name: '雲林縣',
    },
    I: {
        name: '嘉義市',
    },
    Q: {
        name: '嘉義縣',
    },
    D: {
        name: '臺南市',
    },
    E: {
        name: '高雄市',
    },
    T: {
        name: '屏東縣',
    },
    G: {
        name: '宜蘭縣',
    },
    U: {
        name: '花蓮縣',
    },
    V: {
        name: '臺東縣',
    },
    X: {
        name: '澎湖縣',
    },
    W: {
        name: '金門縣',
    },
    Z: {
        name: '連江縣',
    },
};
//# sourceMappingURL=houseConstant.js.map